In [3]:

#Como ver la cantidad de veces que esta repetido cada elemento en la serie, con
#la función value_counts()
numeros_VIP50.value_counts()
 
 #Como juntar 2 o + series de pandas, usaremos la función concat
# Numeros_Extra = pd.Series([34,22,28,61,36])
resultado = pd.concat([numeros_VIP50,Numeros_Extra],ignore_index=True)
print(resultado.sort_values(ascending=True,ignore_index=True))

NameError: name 'numeros_VIP50' is not defined

In [1]:




#Los dataframes en pandas, son estructuras de 2 dimensiones (columnas / filas)
#Se pueden cargar de 2 maneras de manera manual o leyendo de un origen de datos
#puede ser desde un fichero plano (.csv, .txt, .json, .xlsx, .pdf) o de una base
#de datos MS Access, SQL Server, Oracle, Informix, MySQL, Postgres, MariaDB

import pandas as pd

#Paréntesis (), si es una función
#Corchete [], si hay +1 elemento
#LLave {}, para poner registro

#estructura json:
pedidos = pd.DataFrame([
    {'Cliente':'Comercial Pérez S.A','Precio Unidad':1.74,'Cantidad':29},
    {'Cliente':'Distribuciones López','Precio Unidad':2.68,'Cantidad':37},
    {'Cliente':'Almacenes Rodríguez','Precio Unidad':1.65,'Cantidad':64},
    {'Cliente':'Importadora García','Precio Unidad':2.23,'Cantidad':35},
    {'Cliente':'Mercantil Fernández','Precio Unidad':1.64,'Cantidad':19},
    {'Cliente':'Suministros Martínez','Precio Unidad':3.67,'Cantidad':22}
])
# Aquí visualizamos la tabla en formato DataFrame
pedidos

                Cliente  Precio Unidad  Cantidad
0   Comercial Pérez S.A           1.74        29
1  Distribuciones López           2.68        37
2   Almacenes Rodríguez           1.65        64
3    Importadora García           2.23        35
4   Mercantil Fernández           1.64        19
5  Suministros Martínez           3.67        22

In [ ]:
# Como ver solamente un campo o serie:
pedidos['Cliente']

0     Comercial Pérez S.A
1    Distribuciones López
2     Almacenes Rodríguez
3      Importadora García
4     Mercantil Fernández
5    Suministros Martínez
Name: Cliente, dtype: object

In [ ]:
# Como ver más de un campo o serie a la vez
pedidos[['Cliente', 'Precio Unidad']]

                Cliente  Precio Unidad
0   Comercial Pérez S.A           1.74
1  Distribuciones López           2.68
2   Almacenes Rodríguez           1.65
3    Importadora García           2.23
4   Mercantil Fernández           1.64
5  Suministros Martínez           3.67

In [3]:
#Cuando vemos un campo, es lo mismo que ver una Serie, por lo tanto, podemos aplicar las funciones para éstas
pedidos['Cliente'].sort_values(ascending=True, ignore_index=True)

NameError: name 'pedidos' is not defined

In [9]:
#Como añadir un campo o Serie a un DataFrame:
# Opción 1: con un valor manual fijo (que será el mismo para todas las filas o registros) 

pedidos['Zona'] = 'Zona Centro'
pedidos

# Opción 2: con la función apply() 
# ejemplo: vamos a sumar 2 unidades a cantidad para las cantidades > 25 y restar 3 unidades a cantidad para las <=25

def modificar_cant(x):
    if x>25:
        return x+2
    else:
        return x-3
    
#Aplicamos la función
pedidos['Cantidad2'] = pedidos['Cantidad'].apply(modificar_cant)
pedidos
    
# Opción 3: partiendo de una columna existente
pedidos['Cantidad3'] = pedidos['Cantidad'] + 10
pedidos['Cantidad4'] = pedidos['Cantidad'] + pedidos['Cantidad2']
pedidos

,Cliente,Precio Unidad,Cantidad,Zona,Cantidad2,Cantidad3,Cantidad4
0,Comercial Pérez S.A,1.74,29,Zona Centro,31,39,60
1,Distribuciones López,2.68,37,Zona Centro,39,47,76
2,Almacenes Rodríguez,1.65,64,Zona Centro,66,74,130
3,Importadora García,2.23,35,Zona Centro,37,45,72
4,Mercantil Fernández,1.64,19,Zona Centro,16,29,35
5,Suministros Martínez,3.67,22,Zona Centro,19,32,41

In [10]:

pedidos['dif_cantidad'] = pedidos['Cantidad'].max() - pedidos['Cantidad']
pedidos['Transportista'] = 'Seur'
def incremento(x):
    if x>1.70:
        return x*1.10
    else:
        return x

pedidos['Precio Uniad2'] = pedidos['Precio Unidad'].apply(incremento)
pedidos

,Cliente,Precio Unidad,Cantidad,Zona,Cantidad2,Cantidad3,Cantidad4,dif_cantidad,Transportista,Precio Uniad2
0,Comercial Pérez S.A,1.74,29,Zona Centro,31,39,60,35,Seur,1.914
1,Distribuciones López,2.68,37,Zona Centro,39,47,76,27,Seur,2.948
2,Almacenes Rodríguez,1.65,64,Zona Centro,66,74,130,0,Seur,1.650
3,Importadora García,2.23,35,Zona Centro,37,45,72,29,Seur,2.453
4,Mercantil Fernández,1.64,19,Zona Centro,16,29,35,45,Seur,1.640
5,Suministros Martínez,3.67,22,Zona Centro,19,32,41,42,Seur,4.037

In [11]:
# Como eliminar una columna de un DataFrame: drop + el parámetro axis:

pedidos = pedidos.drop(['Precio Uniad2'], axis=1)
# axis=1 significa eliminar la columna
pedidos

,Cliente,Precio Unidad,Cantidad,Zona,Cantidad2,Cantidad3,Cantidad4,dif_cantidad,Transportista
0,Comercial Pérez S.A,1.74,29,Zona Centro,31,39,60,35,Seur
1,Distribuciones López,2.68,37,Zona Centro,39,47,76,27,Seur
2,Almacenes Rodríguez,1.65,64,Zona Centro,66,74,130,0,Seur
3,Importadora García,2.23,35,Zona Centro,37,45,72,29,Seur
4,Mercantil Fernández,1.64,19,Zona Centro,16,29,35,45,Seur
5,Suministros Martínez,3.67,22,Zona Centro,19,32,41,42,Seur

In [12]:
#En una sola línea sin el = puedo machacar el original. Eliminaremos Zona
pedidos.drop(['Zona'], axis=1, inplace=True)
#el inplace=True equivale a in situ
#Se puede hacer así directamente: pedidos.drop(['Zona'])
pedidos

,Cliente,Precio Unidad,Cantidad,Cantidad2,Cantidad3,Cantidad4,dif_cantidad,Transportista
0,Comercial Pérez S.A,1.74,29,31,39,60,35,Seur
1,Distribuciones López,2.68,37,39,47,76,27,Seur
2,Almacenes Rodríguez,1.65,64,66,74,130,0,Seur
3,Importadora García,2.23,35,37,45,72,29,Seur
4,Mercantil Fernández,1.64,19,16,29,35,45,Seur
5,Suministros Martínez,3.67,22,19,32,41,42,Seur

In [13]:
#Si queremos eliminar filas: axis=0 en drop() con número de índice
pedidos.drop([3], axis=0, inplace=True)
pedidos

,Cliente,Precio Unidad,Cantidad,Cantidad2,Cantidad3,Cantidad4,dif_cantidad,Transportista
0,Comercial Pérez S.A,1.74,29,31,39,60,35,Seur
1,Distribuciones López,2.68,37,39,47,76,27,Seur
2,Almacenes Rodríguez,1.65,64,66,74,130,0,Seur
4,Mercantil Fernández,1.64,19,16,29,35,45,Seur
5,Suministros Martínez,3.67,22,19,32,41,42,Seur

In [14]:
#Como colocar un DataFrame mediante un fichero. Iremos a GitHub y descargaremos el #January 2019.csv, February 2019.csv y March 2019.csb 
# Para cargar un DataFrame tipo .csv no es necesario otras librerías
import pandas as pd
ventas = pd.read_csv(r".\DataFrames\January 2019.csv")
ventas
#Dentro del paréntesis ponemos la ruta del fichero
#En windows, los slash van al revés. La solución es:
#   a) duplicar la barra \\
#   b) poner la barra al revés /
#   c) poner una r delante

     IdOrder        Date   Country  Units   Revenue              Customer
0          1  2019-01-08       USA    343  15461.36     Octan Corporation
1          2  2019-01-04    Panama     93   4681.26       Rich Industries
2          3  2019-01-07    Panama     42   2220.36  Blue Sun Corporation
3          4  2019-01-16    Brazil    103   1853.78        Hexagon Global
4          5  2019-01-17       USA     28    286.30     Octan Corporation
..       ...         ...       ...    ...       ...                   ...
184      185  2019-01-25       USA    337   4352.75     Octan Corporation
185      186  2019-01-20  Colombia    197   3256.95                BiffCo
186      187  2019-01-14    Brazil    214  12188.36        Hexagon Global
187      188  2019-01-12  Colombia    102   6566.51     Octan Corporation
188      189  2019-01-26    Panama     77   5103.71        Hexagon Global

[189 rows x 6 columns]

In [15]:
#Para ver los primeros N registros, usaremos la función head. Como máximo se podrán ver 60 
# de manera contínua.

ventas.head(10)

   IdOrder        Date Country  Units   Revenue              Customer
0        1  2019-01-08     USA    343  15461.36     Octan Corporation
1        2  2019-01-04  Panama     93   4681.26       Rich Industries
2        3  2019-01-07  Panama     42   2220.36  Blue Sun Corporation
3        4  2019-01-16  Brazil    103   1853.78        Hexagon Global
4        5  2019-01-17     USA     28    286.30     Octan Corporation
5        6  2019-01-24  Canada    372  24826.98     Spacely Sprockets
6        7  2019-01-26  Canada     61   1592.42                BiffCo
7        8  2019-01-28  Canada    264   3228.11    Delos Incorporated
8        9  2019-01-13  Canada     27    257.97     Monarch Solutions
9       10  2019-01-28  Brazil    323   3024.25                 Hooli

In [16]:
#Para ver los últimos N registros, usaremos tail:
ventas.tail(10)

     IdOrder        Date   Country  Units   Revenue           Customer
179      180  2019-01-26  Colombia     82   2997.26            Initech
180      181  2019-01-22    Brazil    347   2855.54   Wonka Industries
181      182  2019-01-17    Brazil    300  14911.08   Stark Industries
182      183  2019-01-23    Panama    139     49.69            Initech
183      184  2019-01-03    Canada    263  10726.25             BiffCo
184      185  2019-01-25       USA    337   4352.75  Octan Corporation
185      186  2019-01-20  Colombia    197   3256.95             BiffCo
186      187  2019-01-14    Brazil    214  12188.36     Hexagon Global
187      188  2019-01-12  Colombia    102   6566.51  Octan Corporation
188      189  2019-01-26    Panama     77   5103.71     Hexagon Global

In [17]:
#Como podemos ver información del DataFrame? (entries, columnas, nombre y tipo)

ventas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 189 entries, 0 to 188
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   IdOrder   189 non-null    int64
 1   Date      189 non-null    object
 2   Country   189 non-null    object
 3   Units     189 non-null    int64
 4   Revenue   189 non-null    float64
 5   Customer  189 non-null    object
dtypes: float64(1), int64(2), object(3)
memory usage: 9.0+ KB

In [18]:
#Ver los 5 primeros nombres de Customer, ordenados
ventas['Customer'].head(5).sort_values(ascending=True)
#El ascending depende del tipo de dato
    #Texto/Oject alfabéticamente
    #Número valor
    #date antiguedad

2    Blue Sun Corporation
3          Hexagon Global
0       Octan Corporation
4       Octan Corporation
1         Rich Industries
Name: Customer, dtype: object

In [19]:
#Como ver los primeros 3 registros cuyas units > 100
ventas[ventas['Units']>100].head(3)

   IdOrder        Date Country  Units   Revenue           Customer
0        1  2019-01-08     USA    343  15461.36  Octan Corporation
3        4  2019-01-16  Brazil    103   1853.78     Hexagon Global
5        6  2019-01-24  Canada    372  24826.98  Spacely Sprockets

In [20]:
#Como ver los primeros 3 registros cuyas units > 100, en orden
ventas[ventas['Units']>100].sort_values(ascending=True, by='Units').head(3)
#deberemos utilizar el by para decirle sobre qué campo queremos ordenar

     IdOrder        Date   Country  Units  Revenue           Customer
187      188  2019-01-12  Colombia    102  6566.51  Octan Corporation
3          4  2019-01-16    Brazil    103  1853.78     Hexagon Global
122      123  2019-01-21       USA    110  1340.29      Umbrella Corp

In [21]:
#Queremos ver los ultimos 10 Customers cuyo nombre contenga la palabra 'Industries'
#Comodín: [Ii]ndustries => SOLO PARA CONTAINS
ventas[ventas['Customer'].str.contains('[Ii]ndustries')].tail(10)

     IdOrder        Date   Country  Units   Revenue             Customer
117      118  2019-01-13    Brazil     73   1565.69  Vandelay Industries
125      126  2019-01-25    Canada    351  34287.19     Stark Industries
129      130  2019-01-09       USA     94   2218.79     Stark Industries
157      158  2019-01-13  Colombia    395   9533.13  Abstergo Industries
161      162  2019-01-28    Canada    371   5661.27     Stark Industries
162      163  2019-01-03  Colombia     45   2346.82  Abstergo Industries
166      167  2019-01-22    Panama    387  10165.37     Wonka Industries
172      173  2019-01-12  Colombia     17    217.73     Wonka Industries
180      181  2019-01-22    Brazil    347   2855.54     Wonka Industries
181      182  2019-01-17    Brazil    300  14911.08     Stark Industries

In [22]:
#Ver todos los Customers cuyo nombre empieza por W
ventas[ventas['Customer'].str.startswith('W')]

     IdOrder        Date   Country  Units   Revenue           Customer
21        22  2019-01-05       USA    279  12881.19  Wayne Enterprises
61        62  2019-01-25    Panama     30    751.31   Wonka Industries
66        67  2019-01-01    Canada    307  16448.55     Weyland-Yutani
72        73  2019-01-11       USA    138   7199.14     Weyland-Yutani
77        78  2019-01-17    Panama    347  12848.19  Wayne Enterprises
94        95  2019-01-31    Panama    196   1134.15   Wonka Industries
138      139  2019-01-04  Colombia    350   6070.06  Wayne Enterprises
166      167  2019-01-22    Panama    387  10165.37   Wonka Industries
172      173  2019-01-12  Colombia     17    217.73   Wonka Industries
174      175  2019-01-06       USA    127   1684.76  Wayne Enterprises
180      181  2019-01-22    Brazil    347   2855.54   Wonka Industries

In [23]:
#Ver todos los Customers cuyo nombre termina por 'S'
ventas[ventas['Customer'].str.endswith('s')]

,IdOrder,Date,Country,Units,Revenue,Customer
1,2,2019-01-04,Panama,93,4681.26,Rich Industries
5,6,2019-01-24,Canada,372,24826.98,Spacely Sprockets
8,9,2019-01-13,Canada,27,257.97,Monarch Solutions
10,11,2019-01-27,Canada,187,4046.31,Yoyodyne Propulsion Systems
16,17,2019-01-15,Colombia,392,16229.64,Cyberdyne Systems
...,...,...,...,...,...,...
166,167,2019-01-22,Panama,387,10165.37,Wonka Industries
172,173,2019-01-12,Colombia,17,217.73,Wonka Industries
174,175,2019-01-06,USA,127,1684.76,Wayne Enterprises
180,181,2019-01-22,Brazil,347,2855.54,Wonka Industries
181,182,2019-01-17,Brazil,300,14911.08,Stark Industries

In [24]:
#Como averiguar cuantos registros cumplen la condición flitrada
print('Numeros de registros que contienen "Industries":', ventas[ventas['Customer'].str.contains('Industries')].IdOrder.count())
#count() sólo cuenta registros non-null.

Numeros de registros que contienen "Industries": 33

In [25]:
#Como aplicar más de una condición en el filtro: usaremos los operadores lógicos.
#or => |
#and => &
#Ejercicio: ver los registros que son de 'Brazil' o 'Panamá'
ventas[(ventas['Country']=='Brazil')|(ventas['Country']=='Panama')]

     IdOrder        Date Country  Units   Revenue              Customer
1          2  2019-01-04  Panama     93   4681.26       Rich Industries
2          3  2019-01-07  Panama     42   2220.36  Blue Sun Corporation
3          4  2019-01-16  Brazil    103   1853.78        Hexagon Global
9         10  2019-01-28  Brazil    323   3024.25                 Hooli
14        15  2019-01-04  Brazil    271   1726.70             Acme Corp
..       ...         ...     ...    ...       ...                   ...
180      181  2019-01-22  Brazil    347   2855.54      Wonka Industries
181      182  2019-01-17  Brazil    300  14911.08      Stark Industries
182      183  2019-01-23  Panama    139     49.69               Initech
186      187  2019-01-14  Brazil    214  12188.36        Hexagon Global
188      189  2019-01-26  Panama     77   5103.71        Hexagon Global

[79 rows x 6 columns]

In [26]:
#Ejercicio: ver los registros que son de 'Brazil' o Revenue>2000
ventas[(ventas['Country']=='Brazil')|(ventas['Revenue']>2000)]

     IdOrder        Date   Country  Units   Revenue              Customer
0          1  2019-01-08       USA    343  15461.36     Octan Corporation
1          2  2019-01-04    Panama     93   4681.26       Rich Industries
2          3  2019-01-07    Panama     42   2220.36  Blue Sun Corporation
3          4  2019-01-16    Brazil    103   1853.78        Hexagon Global
5          6  2019-01-24    Canada    372  24826.98     Spacely Sprockets
..       ...         ...       ...    ...       ...                   ...
184      185  2019-01-25       USA    337   4352.75     Octan Corporation
185      186  2019-01-20  Colombia    197   3256.95                BiffCo
186      187  2019-01-14    Brazil    214  12188.36        Hexagon Global
187      188  2019-01-12  Colombia    102   6566.51     Octan Corporation
188      189  2019-01-26    Panama     77   5103.71        Hexagon Global

[149 rows x 6 columns]

In [27]:
#Ejercicio: ver los registros que son de 'Brazil' y Revenue>2000 y units>200
ventas[(ventas['Country']=='Brazil')&(ventas['Revenue']>2000)&(ventas['Units']>200)]

     IdOrder        Date Country  Units   Revenue              Customer
9         10  2019-01-28  Brazil    323   3024.25                 Hooli
19        20  2019-01-03  Brazil    377  30840.25              Virtucon
73        74  2019-01-19  Brazil    252   3449.39          Soylent Corp
75        76  2019-01-24  Brazil    364  13878.72       Rich Industries
95        96  2019-01-06  Brazil    240   6998.14      Nakatomi Trading
99       100  2019-01-05  Brazil    217  10063.03               MomCorp
106      107  2019-01-05  Brazil    383  11854.56     Octan Corporation
107      108  2019-01-12  Brazil    258  12418.27                Oscorp
115      116  2019-01-18  Brazil    399  18504.17      Stark Industries
133      134  2019-01-10  Brazil    218   8645.21    Globex Corporation
140      141  2019-01-22  Brazil    243   8414.59      Nakatomi Trading
142      143  2019-01-05  Brazil    343  18184.36  Blue Sun Corporation
160      161  2019-01-17  Brazil    300  15400.77               MomCorp
168      169  2019-01-15  Brazil    334   5471.35                Oscorp
169      170  2019-01-18  Brazil    345   5889.58    Globex Corporation
178      179  2019-01-19  Brazil    318  11343.74                 Hooli
180      181  2019-01-22  Brazil    347   2855.54      Wonka Industries
181      182  2019-01-17  Brazil    300  14911.08      Stark Industries
186      187  2019-01-14  Brazil    214  12188.36        Hexagon Global

In [28]:
#Ejercicio: ver los registros que Revenue 5000-15000: clasifico todos los registros dentro de este tramo.
ventas[(ventas['Revenue']>=5000)&(ventas['Revenue']<=15000)].sort_values(ascending=True, by='Revenue')

     IdOrder        Date   Country  Units   Revenue            Customer
31        32  2019-01-12  Colombia    175   5058.76        Soylent Corp
188      189  2019-01-26    Panama     77   5103.71      Hexagon Global
53        54  2019-01-20    Panama    137   5174.79      Dunder Mifflin
168      169  2019-01-15    Brazil    334   5471.35              Oscorp
161      162  2019-01-28    Canada    371   5661.27    Stark Industries
..       ...         ...       ...    ...       ...                 ...
33        34  2019-01-08    Canada    220  13798.08  Tyrell Corporation
75        76  2019-01-24    Brazil    364  13878.72     Rich Industries
29        30  2019-01-17       USA    298  14543.85              BiffCo
100      101  2019-01-09    Canada    207  14860.00   Spacely Sprockets
181      182  2019-01-17    Brazil    300  14911.08    Stark Industries

[66 rows x 6 columns]